{
    "Hi, my name is": "Привет, меня зовут",
    "Denis Vishnevski": "Денис Вишневский",
    "I'm a front-end developer": "я фронтенд-разработчик",
    "Contact with me": "Свяжитесь со мной",
    "PROJECTS": "ПРОЕКТЫ",
    "SKILLS": "НАВЫКИ",
    "CONTACTS": "КОНТАКТЫ",

    "About me": "Обо мне",
    "aboutMe_block1": "На протяжении 2 лет обучался программированию сам. Я решил, что не нуждаюсь в платных курсах и способен любую информацию найти самостоятельно. Больше года потратил на изучение C# и Unity, но решил оставить создание игр как хобби. Начал изучать ASP.NET Core, но понял, что мне гораздо более интeресна фронтенд разработка.",
    "aboutMe_block2": "Каждый день я стараюсь улучшать свои навыки, стремлюсь писать хорошо читаемый и легко поддерживаемый код. Имею опыт работы в коллективе: закончил музыкальный колледж, где играл в разных коллективах от 3 до 50 человек. Также 2 года работал звукооператором: научился работать с быстро меняющимися задачами разной сложности.",
    "aboutMe_block3": "Сейчас я все свободное время посвящаю написанию сайтов на React, изучаю все нужные для этого технологии. На новой работе хочу поучаствовать в интересных проектах, получить драгоценный для junior разработчика опыт коммерческой разработки и благодаря своему усердию и энтузиазму в скором времени стать middle разработчиком.",

    "Skills": "Навыки",
    "Layouting": "Вёрстка",
    "Programming": "Программирование",
    "More": "Ещё",
    "HTML_skill" : "Стремлюсь к написанию семантического HTML кода и понятных названий классов.",
    "CSS_skill": "При адаптации сайта под разные устройсва по возможности использую такие функции как min(), max() и clamp(), которые помогают избавиться от лишних медиа-запросов.",
    "SASS_skill": "Этот сайт я написал с использованием SASS, нашел для себя много преимущества использования препроцессоров перед css.",
    "JavaScript_skill": "Использовал в своих проектах на практике большую часть всех возможностей ES6+.",
    "TypeScript_skill": "Так как до этого учил C#, и привык к статической типизации, я быстро разобрался в TypeScript и полностью на него перешёл в своих проектах.",
    "React_skill": "Стараюсь строить удобную для разработчика и легко поддержививаемую архитектору приложений.",
    "Redux_skill": "Использовал Redux при создании ",
    "Redux_skill_link": "Лендинга для фотографа",
    "Redux_slill2": ", чтобы не пришлось передавать переменную через несколько компонентов.",
    "Figma_skill": "Умею экспортировать изображения, работать со слоями, стилями, вкладкой Inspect. При необходимости могу внести правки в макет.",
    "C#_skill": "Пишу гиперказуальные игры на Unity, могу написать простой API с помощью ASP.NET Core.",
    "ASP.NET_slill": "Базовое понимание работы бекенда, HTTP-запросов и REST API.",

    "Portfolio": "Портфолио",
    "Landing for a photographer": "Лендинг для фотографа",
    "Personal portfolio website": "Личный сайт-портфолио",
    "Go to website": "Перейти на сайт",

    "Contacts": "Контакты"
}